In [1]:
import pandas as pd
import sqlite3

Flight Data
Convert to SQL datafile (e.g., .db)
Connect to SQL file, convert to pandas DF, groupby Year/Origin/Destination/Carrier and give mean or max/min of air_time or distance or delay and sort.

# Loading CSV Data File

In [2]:
# LOADING CSV FILE
# Na_values may need to be reviewed as some datasets may include an accronym.
# For example, 'NA' may be an abbreviation for 'North America'.
df_data_flights = pd.read_csv('./input_data/flights.csv', 
                      #encoding = "utf-8-sig",
                      #parse_dates=['year'],
                      keep_default_na=False,
                      na_values=['', '-1.#IND', '1.#QNAN', '1.#IND', '-1.#QNAN', '#N/A','N/A', '#NA', 'NULL', 'NaN', '-NaN', 'nan', '-nan']) 

df_data_airports = pd.read_csv('./input_data/airports.csv', 
                               #encoding = "utf-8-sig",
                               #parse_dates=['year'],
                               keep_default_na=False,
                               na_values=['', '-1.#IND', '1.#QNAN', '1.#IND', '-1.#QNAN', '#N/A','N/A', '#NA', 'NULL', 'NaN', '-NaN', 'nan', '-nan']) 

df_data_airlines = pd.read_csv('./input_data/airlines.csv', 
                               #encoding = "utf-8-sig",
                               #parse_dates=['year'],
                               keep_default_na=False,
                               na_values=['', '-1.#IND', '1.#QNAN', '1.#IND', '-1.#QNAN', '#N/A','N/A', '#NA', 'NULL', 'NaN', '-NaN', 'nan', '-nan']) 


# IF LOADING EXCEL FILE: use pd.read_excel.
#df_data = pd.read_excel('.\input_data\FILE_NAME.xlsx', parse_dates=['Date', 'Final Date'])

# Encoding "cp1252" or "utf-8-sig" used so that Excel does not create special characters. Standard Python is utf-8.
# See reference for explanation https://stackoverflow.com/questions/57061645/why-is-%C3%82-printed-in-front-of-%C2%B1-when-code-is-run

In [3]:
df_data_flights.head(3)

,Unnamed: 0,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,361,2013,1,1,1315,-2,1413,-10,EV,N13538,4112,EWR,ALB,33,143,13,15
1,570,2013,1,1,1655,34,1804,40,EV,N19554,3260,EWR,ALB,36,143,16,55
2,785,2013,1,1,2056,52,2156,44,EV,N12540,4170,EWR,ALB,31,143,20,56

In [4]:
df_data_airports.head(3)

,faa,name,lat,lon,alt,tz,dst,tzone
0,04G,Lansdowne Airport,41.130472,-80.619583,1044,-5,A,America/New_York
1,06A,Moton Field Municipal Airport,32.460572,-85.680028,264,-6,A,America/Chicago
2,06C,Schaumburg Regional,41.989341,-88.101243,801,-6,A,America/Chicago

In [5]:
df_data_airlines.head(3)

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.

# Converting Dataframe to SQL

In [6]:
conn = sqlite3.connect('./output_data/flights_database.db') # Creates the flights_database
c = conn.cursor() # Creates cursor.

In [7]:
# Creates the flights table within the flights_database
df_data_flights.to_sql('flights', conn, if_exists='replace', index = False)

145735

In [8]:
# Creates the airports table within the flights_database
df_data_airports.to_sql('airports', conn, if_exists='replace', index = False)

1458

In [9]:
# Creates the airlines table within the flights_database
df_data_airlines.to_sql('airlines', conn, if_exists='replace', index = False)

16

In [10]:
conn.close() # Closes connection.

# Notebook End